# BoundaryValidation Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundaryValidation Class
Members See Also
---
Curve loop validators.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public class BoundaryValidation : IDisposable
```

Visual Basic
---
```text
Public Class BoundaryValidation _
	Implements IDisposable
```

Visual C++
---
```text
public ref class BoundaryValidation : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BoundaryValidation
# See Also
BoundaryValidation Members
Autodesk.Revit.DB Namespace